/*
 * (C) Copyright 2008-2014 Rockchip Electronics
 *
 * See file CREDITS for list of people who contributed to this
 * project.
 *
 * This program is free software; you can redistribute it and/or
 * modify it under the terms of the GNU General Public License as
 * published by the Free Software Foundation; either version 2 of
 * the License, or (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program; if not, write to the Free Software
 * Foundation, Inc., 59 Temple Place, Suite 330, Boston,
 * MA 02111-1307 USA
 */
#include <common.h>
#include <lcd.h>
#include <asm/arch/rkplat.h>


#define LcdReadBit(addr, msk)      ((regbak.addr=preg->addr)&(msk))
#define LcdWrReg(addr, val)        preg->addr=regbak.addr=(val)
#define LcdRdReg(addr)             (preg->addr)
#define LcdSetBit(addr, msk)       preg->addr=((regbak.addr) |= (msk))
#define LcdClrBit(addr, msk)       preg->addr=((regbak.addr) &= ~(msk))
#define LcdSetRegBit(addr, msk)    preg->addr=((preg->addr) |= (msk))
#define LcdMskReg(addr, msk, val)  (regbak.addr)&=~(msk);   preg->addr=(regbak.addr|=(val))
#define LCDC_REG_CFG_DONE()		LcdWrReg(REG_CFG_DONE, 0x01); 


/********************************************************************
**                          结构定义                                *
********************************************************************/
/* LCDC的寄存器结构 */
typedef volatile struct tagLCDC_REG
{
    /* offset 0x00~0xc0 */
    unsigned int REG_CFG_DONE;           //0x00 REGISTER CONFIG FINISH
    unsigned int VERSION_INFO;           //0x04
	unsigned int SYS_CTRL;               //0x08 system control register 0
	unsigned int SYS_CTRL1;              //0x0c system control register 1
	unsigned int DSP_CTRL0;				 //0x10 display control register 0
	unsigned int DSP_CTRL1;				 //0x14 display control register 1
	unsigned int DSP_BG;                 //0x18 backgroundcolor
	unsigned int MCU_CTRL;				 //0x1c MCU mode contol register
	unsigned int INTR_CTRL0;             //0x20 Interruptctrl register0
	unsigned int INTR_CTRL1;             //0x24 Interruptctrl register1
	unsigned int INTR_RESERVED0;         //0x28 
	unsigned int INTR_RESERVED1;         //0x2c
	
    unsigned int WIN0_CTRL0;             //0x30 win0 ctrlregister0
    unsigned int WIN0_CTRL1;             //0x34 win0 ctrlregister1
    unsigned int WIN0_COLOR_KEY;         //0x38 Win0 colorkey register
    unsigned int WIN0_VIR;               //0x3c Win0 virtual stride
    unsigned int WIN0_YRGB_MST;          //0x40 Win0 YRGB memory start address
    unsigned int WIN0_CBR_MST;           //0x44 Win0 Cbr memory start address
    unsigned int WIN0_ACT_INFO;          //0x48 Win0 active window width/height
    unsigned int WIN0_DSP_INFO;          //0x4c Win0 display width/height on panel
    unsigned int WIN0_DSP_ST;            //0x50 Win0 display start point on panel
    unsigned int WIN0_SCL_FACTOR_YRGB;   //0x54 Win0 YRGB scaling factor 
    unsigned int WIN0_SCL_FACTOR_CBR;    //0x58 Win0 Cbr scaling factor 
    unsigned int WIN0_SCL_OFFSET;        //0x5c Win0 scaling start point offset
    unsigned int WIN0_SRC_ALPHA_CTRL;    //0x60
    unsigned int WIN0_DST_ALPHA_CTRL;    //0x64
    unsigned int WIN0_FADING_CTRL;       //0x68
    unsigned int WIN0_RESERVED0;         //0x6c

    unsigned int WIN1_CTRL0;             //0x70 win1 ctrlregister0
    unsigned int WIN1_CTRL1;             //0x74 win1 ctrlregister1
    unsigned int WIN1_COLOR_KEY;         //0x78 Win1 colorkey register
    unsigned int WIN1_VIR;               //0x7c Win1 virtualstride
    unsigned int WIN1_YRGB_MST;          //0x80 Win1 YRGB memory start address
    unsigned int WIN1_CBR_MST;           //0x84 Win1 Cbr memory start address
    unsigned int WIN1_ACT_INFO;          //0x88 Win1 active window width/height
    unsigned int WIN1_DSP_INFO;          //0x8c Win1 display width/height on panel
    unsigned int WIN1_DSP_ST;            //0x90 Win1 display start point on panel
    unsigned int WIN1_SCL_FACTOR_YRGB;   //0x94 Win1 YRGB scaling factor 
    unsigned int WIN1_SCL_FACTOR_CBR;    //0x98 Win1 Cbr scaling factor 
    unsigned int WIN1_SCL_OFFSET;        //0x9c Win1 scaling start point offset
    unsigned int WIN1_SRC_ALPHA_CTRL;    //0xa0
    unsigned int WIN1_DST_ALPHA_CTRL;    //0xa4
    unsigned int WIN1_FADING_CTRL;       //0xa8
    unsigned int WIN1_RESERVED0;         //0xac  
    unsigned int RESERVED2[48];          //0xb0-0x16c
    unsigned int POST_DSP_HACT_INFO;     //0x170 posts caler down horizontal start and end
    unsigned int POST_DSP_VACT_INFO;     //0x174 Panel active horizontal scanning start point and end point
    unsigned int POST_SCL_FACTOR_YRGB;   //0x178 posty rgb scaling factor
    unsigned int POST_RESERVED;          //0x17c 
    unsigned int POST_SCL_CTRL;          //0x180 post scaling start point offset
    unsigned int POST_DSP_VACT_INFO_F1;  //0x184 Panel active horizontal scanning start point and end point F1
    unsigned int DSP_HTOTAL_HS_END;       //0x188 Panel scanning horizontal width and hsync pulse end point
	unsigned int DSP_HACT_ST_END;         //0x18c Panel active horizontal scanning start/end point
	unsigned int DSP_VTOTAL_VS_END;       //0x190 Panel scanning vertical height and vsync pulse end point
	unsigned int DSP_VACT_ST_END;         //0x194 Panel active vertical scanning start/end point
	unsigned int DSP_VS_ST_END_F1;        //0x198 Vertical scanning start point and vsync pulse end point of even filed in interlace mode
	unsigned int DSP_VACT_ST_END_F1;      //0x19c Vertical scanning active start/end point of even filed in interlace mode
} LCDC_REG, *pLCDC_REG;

/*******************register definition**********************/
#define m_fpga_version (0xffff<<16)
#define m_rtl_version  (0xffff)

#define m_auto_gating_en (1<<23)
#define m_standby_en     (1<<22)
#define m_dma_stop       (1<<21)
#define m_mmu_en         (1<<20)
#define m_dma_burst_length (0x3<<18)
#define m_mipi_out_en      (1<<15)
#define m_edp_out_en       (1<<14)
#define m_hdmi_out_en      (1<<13)
#define m_rgb_out_en       (1<<12)
#define m_edpi_wms_fs      (1<<10)
#define m_edpi_wms_mode    (1<<9)
#define m_edpi_halt_en     (1<<8)
#define m_doub_ch_overlap_num (0xf<<4)
#define m_doub_channel_en     (1<<3)
#define m_direct_path_layer_sel (0x3<<1)
#define m_direct_path_en       (1)

#define v_auto_gating_en(x) (((x)&1)<<23)
#define v_standby_en(x)     (((x)&1)<<22)
#define v_dma_stop(x)       (((x)&1)<<21)
